{"keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "use_bias": true, "batch_input_shape": [null, 128, 128, 3], "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "name": "conv2d_1", "filters": 6, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "name": "conv2d_2", "filters": 6, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "name": "conv2d_3", "filters": 3, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "activity_regularizer": null}}]}